Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.1.31/samha0ab/edc/ATSAMHA0G15AB.PIC
      <edc:SFRDef edc:_addr="0x42002810" edc:access="----nnnnnnnnnnnn-nnnnnnnnnnnn-nn" edc:cname="FCTRLB" edc:impl="0xFFF7FFB" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="SRC" edc:desc="Fault B Source" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Fault input disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="MCEx (x=0,1) event input" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="INVERT" edc:desc="Inverted MCEx (x=0,1) event input" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="ALTFAULT" edc:desc="Alternate fault (A or B) state at the end of the previous period" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="KEEP" edc:desc="Fault B Keeper" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QUAL" edc:desc="Fault B Qualification" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BLANK" edc:desc="Fault B Blanking Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No blanking applied" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISE" edc:desc="Blanking applied from rising edge of the output waveform" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALL" edc:desc="Blanking applied from falling edge of the output waveform" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Blanking applied from each toggle of the output waveform" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RESTART" edc:desc="Fault B Restart" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HALT" edc:desc="Fault B Halt Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Halt action disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HW" edc:desc="Hardware halt action" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SW" edc:desc="Software halt action" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="NR" edc:desc="Non-recoverable fault" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHSEL" edc:desc="Fault B Capture Channel" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CC0" edc:desc="Capture value stored in channel 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CC1" edc:desc="Capture value stored in channel 1" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CC2" edc:desc="Capture value stored in channel 2" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CC3" edc:desc="Capture value stored in channel 3" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CAPTURE" edc:desc="Fault B Capture Action" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="No capture" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CAPT" edc:desc="Capture on fault" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMIN" edc:desc="Minimum capture" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CAPTMAX" edc:desc="Maximum capture" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="LOCMIN" edc:desc="Minimum local detection" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="LOCMAX" edc:desc="Maximum local detection" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DERIV0" edc:desc="Minimum and maximum local detection" edc:when="(field &amp; 0x7) == 6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BLANKVAL" edc:desc="Fault B Blanking Time" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="FILTERVAL" edc:desc="Fault B Filter Value" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002814" edc:access="nnnnnnnnnnnnnnnn----nnnn------nn" edc:cname="WEXCTRL" edc:impl="0xFFFF0F03" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="OTMX" edc:desc="Output Matrix" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DTIEN0" edc:desc="Dead-time Insertion Generator 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTIEN1" edc:desc="Dead-time Insertion Generator 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTIEN2" edc:desc="Dead-time Insertion Generator 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTIEN3" edc:desc="Dead-time Insertion Generator 3 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DTLS" edc:desc="Dead-time Low Side Outputs Value" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DTHS" edc:desc="Dead-time High Side Outputs Value" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002818" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DRVCTRL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="NRE0" edc:desc="Non-Recoverable State 0 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRE1" edc:desc="Non-Recoverable State 1 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRE2" edc:desc="Non-Recoverable State 2 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRE3" edc:desc="Non-Recoverable State 3 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRE4" edc:desc="Non-Recoverable State 4 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRE5" edc:desc="Non-Recoverable State 5 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRE6" edc:desc="Non-Recoverable State 6 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRE7" edc:desc="Non-Recoverable State 7 Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRV0" edc:desc="Non-Recoverable State 0 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRV1" edc:desc="Non-Recoverable State 1 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRV2" edc:desc="Non-Recoverable State 2 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRV3" edc:desc="Non-Recoverable State 3 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRV4" edc:desc="Non-Recoverable State 4 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRV5" edc:desc="Non-Recoverable State 5 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRV6" edc:desc="Non-Recoverable State 6 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRV7" edc:desc="Non-Recoverable State 7 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN0" edc:desc="Output Waveform 0 Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN1" edc:desc="Output Waveform 1 Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN2" edc:desc="Output Waveform 2 Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN3" edc:desc="Output Waveform 3 Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN4" edc:desc="Output Waveform 4 Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN5" edc:desc="Output Waveform 5 Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN6" edc:desc="Output Waveform 6 Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN7" edc:desc="Output Waveform 7 Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FILTERVAL0" edc:desc="Non-Recoverable Fault Input 0 Filter Value" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FILTERVAL1" edc:desc="Non-Recoverable Fault Input 1 Filter Value" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200281C" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4200281E" edc:access="-----n-n" edc:cname="DBGCTRL" edc:impl="0x5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Running Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FDDBD" edc:desc="Fault Detection on Debug Break Detection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200281F" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x42002820" edc:access="----nnnn----nnnnnnnn-nnnnnnnnnnn" edc:cname="EVCTRL" edc:impl="0xF0FF7FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="EVACT0" edc:desc="Timer/counter Input Event0 Action" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Event action disabled" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Start, restart or re-trigger counter on event" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="COUNTEV" edc:desc="Count on event" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="START" edc:desc="Start counter on event" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="INC" edc:desc="Increment counter on event" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="COUNT" edc:desc="Count on active state of asynchronous event" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="FAULT" edc:desc="Non-recoverable fault" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EVACT1" edc:desc="Timer/counter Input Event1 Action" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Event action disabled" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Re-trigger counter on event" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIR" edc:desc="Direction control" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Stop counter on event" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DEC" edc:desc="Decrement counter on event" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="PPW" edc:desc="Period capture value in CC0 register, pulse width capture value in CC1 register" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="PWP" edc:desc="Period capture value in CC1 register, pulse width capture value in CC0 register" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="FAULT" edc:desc="Non-recoverable fault" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CNTSEL" edc:desc="Timer/counter Output Event Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="START" edc:desc="An interrupt/event is generated when a new counter cycle starts" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="END" edc:desc="An interrupt/event is generated when a counter cycle ends" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="BETWEEN" edc:desc="An interrupt/event is generated when a counter cycle ends, except for the first and last cycles" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOUNDARY" edc:desc="An interrupt/event is generated when a new counter cycle starts or a counter cycle ends" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OVFEO" edc:desc="Overflow/Underflow Output Event Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGEO" edc:desc="Retrigger Output Event Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNTEO" edc:desc="Timer/counter Output Event Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TCINV0" edc:desc="Inverted Event 0 Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCINV1" edc:desc="Inverted Event 1 Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCEI0" edc:desc="Timer/counter Event 0 Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCEI1" edc:desc="Timer/counter Event 1 Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEI0" edc:desc="Match or Capture Channel 0 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEI1" edc:desc="Match or Capture Channel 1 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEI2" edc:desc="Match or Capture Channel 2 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEI3" edc:desc="Match or Capture Channel 3 Event Input Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCEO0" edc:desc="Match or Capture Channel 0 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEO1" edc:desc="Match or Capture Channel 1 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEO2" edc:desc="Match or Capture Channel 2 Event Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEO3" edc:desc="Match or Capture Channel 3 Event Output Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002824" edc:access="------------nnnnnnnnn-------nnnn" edc:cname="INTENCLR" edc:impl="0xFF80F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:desc="Retrigger Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Counter Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="Match or Capture Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="Match or Capture Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:desc="Match or Capture Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:desc="Match or Capture Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002828" edc:access="------------nnnnnnnnn-------nnnn" edc:cname="INTENSET" edc:impl="0xFF80F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC2">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:desc="Retrigger Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:desc="Counter Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:desc="Non-Recoverable Debug Fault Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:desc="Recoverable Fault A Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:desc="Recoverable Fault B Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:desc="Non-Recoverable Fault 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:desc="Non-Recoverable Fault 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="Match or Capture Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="Match or Capture Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:desc="Match or Capture Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:desc="Match or Capture Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
